---
kind: type
id: T:Autodesk.Revit.DB.WallLocationLine
source: html/87090d88-570b-6f84-cf87-63414b51ece0.htm
---
# Autodesk.Revit.DB.WallLocationLine

This enumerated type represents the options for alignment of a wall's location line.

## Syntax (C#)
```csharp
public enum WallLocationLine
```